#include "character_classes.h"

// Возвращает карту классов и их диапазоны навыков
QMap<QString, CharacterClasses::ClassInfo> CharacterClasses::getClasses()
{
    return {
        {"Офицер Службы Безопасности", {20, 35, 10, 20, 10, 20, 10, 20}},  // Сильный в оружии
        {"Медик", {10, 20, 20, 35, 10, 20, 10, 20}},  // Сильный в медицине
        {"Инженер", {10, 20, 10, 20, 10, 20, 20, 35}},  // Хорош в электронике
        {"Механик", {10, 20, 10, 20, 20, 35, 10, 20}},  // Специалист по механике
        {"Помощник", {20, 25, 20, 25, 20, 25, 20, 25}}  // Универсальный персонаж
    };
}
